dot→mermaid
